app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    @todos = Todo.all

INSERT INTO "todos" ("title", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Stimulus"], ["status", 0], ["created_at", "2022-06-09 08:12:30.062645"], ["updated_at", "2022-06-09 08:12:30.062645"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Design"], ["updated_at", "2022-06-09 08:03:11.982150"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_todo
      @todo = Todo.find(params[:id])